requests/password.xml

<ns0:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.deltasolutions.ru/om/rt/LyraOmsService/">
    <ns0:Header />
    <ns0:Body>
        <ns1:SubmitOrderRequest>
            <Components>
                
                <Component>
                    <Attributes>
						<Attribute>
                            <Name>cfs_spec_id</Name>
                            <Value>password</Value>
                        </Attribute>
                        <Attribute>
                            <Name>department_id</Name>
                            <Value>4013</Value>
                        </Attribute>
                        <Attribute>
                            <Name>city</Name>
                            <Value>10001</Value>
                        </Attribute>
                        <Attribute>
                            <Name>street</Name>
                            <Value>606</Value>
                        </Attribute>
                        <Attribute>
                            <Name>house</Name>
                            <Value>48</Value>
                        </Attribute>
                        <Attribute>
                            <Name>building</Name>
                            <Value>2</Value>
                        </Attribute>
                        <Attribute>
                            <Name>flat</Name>
                            <Value>129</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_name</Name>
                            <Value>КРОФТ СЕМЕН ИЛЬИЧ</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_type</Name>
                            <Value>3</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_id</Name>
                            <Value>32535243</Value>
                        </Attribute>
                        <Attribute>
                            <Name>rtpl_id</Name>
                            <Value>34890</Value>
                        </Attribute>
                        <Attribute>
                            <Name>prcl_id</Name>
                            <Value>56668</Value>
                        </Attribute>
                        <Attribute>
                            <Name>srls_id</Name>
                            <Value>70998</Value>
                        </Attribute>
                        <Attribute>
                            <Name>srls_quant</Name>
                            <Value>1</Value>
                        </Attribute>
                        <Attribute>
                            <Name>subscriber_id</Name>
                            <Value />
                        </Attribute>
                        <Attribute>
                            <Name>parent_virtual_number</Name>
                            <Value>143434313902</Value>
                        </Attribute>
                        <Attribute>
                            <Name>connection_scheme</Name>
                            <Value>187</Value>
                        </Attribute>
                        <Attribute>
                            <Name>technology</Name>
                            <Value>xPON</Value>
                        </Attribute>
						<Attribute>
                            <Name>password</Name>
                            <Value>qwerlkjfn2</Value>
                        </Attribute>
                        <Attribute>
                            <Name>action_code</Name>
                            <Value>33</Value>
                        </Attribute>
                        <Attribute>
                            <Name>contract_id</Name>
                            <Value>2215008</Value>
                        </Attribute>
                        <Attribute>
                            <Name>exec_date</Name>
                            <Value>2015-07-03T00:00:00+06:00</Value>
                        </Attribute>
                        <Attribute>
                            <Name>service_reciever</Name>
                            <Value>2</Value>
                        </Attribute>
                        <Attribute>
                            <Name>lyra_service_code</Name>
                            <Value>60098</Value>
                        </Attribute>
                        <Attribute>
                            <Name>instance_id</Name>
                            <Value>79011207</Value>
                        </Attribute>
                        <Attribute>
                            <Name>tx_id</Name>
                            <Value>1207</Value>
                        </Attribute>
                        <Attribute>
                            <Name>need_installation</Name>
                            <Value>0</Value>
                        </Attribute>
                    <Attribute>
                            <Name>order_start_date</Name>
                            <Value>2015-07-03T00:00:00+06:00</Value>
                        </Attribute>
                        <Attribute>
                            <Name>order_action_type</Name>
                            <Value>PR</Value>
                        </Attribute>
                        <Attribute>
                            <Name>installation_order_id</Name>
                            <Value>178</Value>
                        </Attribute>
                        <Attribute>
                            <Name>service_receiver</Name>
                            <Value>2</Value>
                        </Attribute>
                        </Attributes>
                </Component>
            </Components>
            <CommonData>
                <Attributes>
                    <Attribute>
                        <Name>main_virtual_number</Name>
                        <Value>143434313900</Value>
                    </Attribute>
                </Attributes>   
            </CommonData>
        </ns1:SubmitOrderRequest>
    </ns0:Body>
</ns0:Envelope>